![New York City schoolbus](schoolbus.jpg)

Photo by [Jannis Lucas](https://unsplash.com/@jannis_lucas) on [Unsplash](https://unsplash.com).
<br>

Every year, American high school students take SATs, which are standardized tests intended to measure literacy, numeracy, and writing skills. There are three sections - reading, math, and writing, each with a maximum score of 800 points. These tests are extremely important for students and colleges, as they play a pivotal role in the admissions process.

Analyzing the performance of schools is important for a variety of stakeholders, including policy and education professionals, researchers, government, and even parents considering which school their children should attend. 

You have been provided with a dataset called `schools.csv`, which is previewed below.

You have been tasked with answering three key questions about New York City (NYC) public school SAT performance.

In [1]:
# Re-run this cell 
import pandas as pd

# Read in the data
schools = pd.read_csv("datasets/schools.csv")

# Preview the data
schools

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7
...,...,...,...,...,...,...,...
370,"Queens High School for Information, Research, ...",Queens,Q465,372,362,352,44.6
371,Rockaway Park High School for Environmental Su...,Queens,Q410,357,381,376,38.5
372,Channel View School for Research,Queens,Q410,427,430,423,76.6
373,Rockaway Collegiate High School,Queens,Q410,399,403,405,46.5
374,Scholars' Academy,Queens,Q180,588,560,568,99.2

Create a pandas DataFrame called best_math_schools containing the "school_name" and "average_math" score for all schools where the results are at least 80% of the maximum possible score, sorted by "average_math" in descending order.

In [2]:
best_math_schools = schools[schools['average_math']>=(0.8 * 800)]
best_math_schools = best_math_schools[['school_name','average_math']]
best_math_schools = best_math_schools.sort_values('average_math', ascending=False)

print(best_math_schools)

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683
280                     Brooklyn Technical High School           682
333                        Townsend Harris High School           680
174  High School of American Studies at Lehman College           669
0    New Explorations into Science, Technology and ...           657
45                       Eleanor Roosevelt High School           641

Identify the `top 10` performing schools based on scores across the three SAT sections, storing as a pandas DataFrame called `top_10_schools` containing the school name and a column named `"total_SAT"`, with results sorted by `total_SAT` in descending order.

In [3]:
schools['total_SAT'] = schools['average_math']+schools['average_reading']+schools['average_writing']

top_10_schools = schools[['school_name','total_SAT']]

top_10_schools = top_10_schools.sort_values('total_SAT', ascending=False).head(10)

top_10_schools

                                           school_name  total_SAT
88                              Stuyvesant High School       2144
170                       Bronx High School of Science       2041
93                 Staten Island Technical High School       2041
174  High School of American Studies at Lehman College       2013
333                        Townsend Harris High School       1981
365  Queens High School for the Sciences at York Co...       1947
5                       Bard High School Early College       1914
280                     Brooklyn Technical High School       1896
45                       Eleanor Roosevelt High School       1889
68   High School for Mathematics, Science, and Engi...       1889

Locate the NYC borough with the largest standard deviation for `"total_SAT"`, storing as a DataFrame called `largest_std_dev` with `"borough"` as the index and three columns: `"num_schools"` for the number of schools in the borough, `"average_SAT"` for the mean of `"total_SAT"`, and `"std_SAT"` for the standard deviation of `"total_SAT"`. Round all numeric values to two decimal places.

In [5]:
# Import numpy with the alias np
aggregated_functions = {
    'school_name': 'count',
    'total_SAT': ['mean', 'std']}


borough_stats = schools.groupby('borough')['total_SAT'].agg(['count','mean', 'std']).round(2)
borough_stats.columns = ['num_schools','average_SAT', 'std_SAT']

# Locate largest standard deviation from borough stats
largest_std_dev = borough_stats[borough_stats['std_SAT'] == borough_stats['std_SAT'].max()]

# Set "borough" as the index
largest_std_dev.index.name = 'borough'

# Display the result
print(largest_std_dev)

           num_schools  average_SAT  std_SAT
borough
Manhattan           89      1340.13   230.29